{
    "intents":[
        {"tag": "greetings",
        "patterns": ["Hello","Hi","hello","hi","greetings","hey have a good day","hey there"],
        "responses":["Hello!","Hi! What can i do for you?"]},
        {"tag": "greetingMore",
        "patterns": [ "You good", "What's up","You OK"],
        "responses": ["I am fine! How about you?", "I am good, you?"]},
        {"tag": "off",
        "patterns": ["goodbye","bye","see you later","thank you","rest","now you can stop","shut down","stop"],
        "responses":["See you later!","Have a good day!","Goodbye!","Bye! See you again later!"]},
        {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
         "responses": ["My pleasure", "You're Welcome"]},
        {"tag":"understand fail",
        "patterns": ["I don't understand", "Sorry, confused", "Can you rephrase?","I don't get it"],
        "responses": ["I apologize, sometimes I miss things. Could you please rephrase your question?", "No worries, happens to the best of us! Can you try asking in a different way?", "I'm still learning. Can you provide more details so I can understand better?"]
        },
        {"tag": "introduce",
        "patterns":["Who are you","Introduce yourself","What's your name","Where are you from?"],
        "responses":["I am an AI chatbot. I was developed by Nguyen Viet Trung from NEU, IT63B"]},
        {"tag":"menu",
        "patterns":["Solve equation","Open Math Menu","Giai phuong trinh","Mo menu giai toan","Giai toan","giải toán","Mở menu giải toán"],
        "responses":["Chọn 1 trong các lựa chọn sau để tiếp tục: \n1: Giải phương trình bậc nhất \n2: Giải phương trình bậc hai\n3: Giải phương trình bậc 3\nStop: Dừng ở trong menu"]},
        {"tag":"math1",
        "patterns":["1","one","bac 1","bac nhat","Giai phuong trinh bac nhat"],
        "responses":["Phương trình bậc nhất có dạng aX + b = 0\n Nhập giá trị a: **\n Nhập giá trị b:"],
        "context":["input_a","input_b","response"]},
        {"tag":"math2",
        "patterns":["2","two","bac 2","bac hai","Giai phuong trinh bac hai"],
        "responses":["Phương trình bậc nhất có dạng aX^2 + bX + c = 0\n Nhập giá trị a: **\n Nhập giá trị b: **\n Nhập giá trị c:"]},
        {"tag":"math3",
        "patterns":["3","three","bac 3","bac ba","Giai phuong trinh bac ba"],
        "responses":["Phương trình bậc nhất có dạng aX^3 + bX^2 + cX+ d = 0\n Nhập giá trị a: **\n Nhập giá trị b: **\n Nhập giá trị c: **\n Nhập giá trị d: "]},
        {"tag":"joke",
        "patterns":["Tell me a joke","Tell me something funny","Say something funny","Show me your sense of humor","Proof that you are a comedian"],
        "responses":["Did you know, if you get pregnant in the Amazon, it's next day delivery","Giao diện của bạn trông mới mẻ đấy, mới cài lại win hả?","Tham gia giao thông như điền vào chỗ trống vậy, thiếu đâu mình đi vô đó!","Cầm tiền thì sợ tiền rơi, cầm tờ A4 đời đời ấm no"]},
        {"tag":"weather",
        "patterns":["What's the weather like?", "Tell me the weather forecast", "going to rain today?", "Weather update", "Weather"],
        "responses":["I don't have real-time news updates. Maybe sunny","I don't have real-time news updates. Maybe rainy","I don't have real-time news updates.Maybe humid","I don't have real-time news updates. Maybe mild"]},
        {"tag":"liên hệ",
        "patterns":["liên hệ","gọi điện","kết nối"],
        "responses":["Người dùng có thể kết nối với công ty chúng tôi qua số điện thoại 0968322403, fanpage facebook hoặc qua email: 0U8Qh@example.com","Người dùng có thể liên hệ với nhân viên của chúng tôi qua số điện thoại 0968322403, fanpage facebook hoặc qua email: 0U8Qh@example.com"]},
        {"tag":"connect",
        "patterns":["connect","call","contact","get in touch","reach"],
        "responses":["You can call us at the phone number 0968322403, connect with us on facebook fanpage or email 0U8Qh@example.com","User/Customer can connect with us through the phone number 0968322403, facebook fanpage or email 0U8Qh@example.com"]},
        {"tag":"NEU",
        "patterns":["Đại học kinh tế quốc dân","NEU","National Economics University"],
        "responses":["NEU is National Economics University","National Economics University là Đại học kinh tế quốc dân"]},
        {"tag":"Trung Tech",
        "patterns":["Trung Tech","Trung_Tech","introduce Trung Tech","giới thiệu Trung Tech"],
        "responses":["At Trung Tech, we're redefining how you experience electronics shopping. Launched in 2024, Trung Tech is the brainchild of passionate individuals who believe that technology should be accessible, powerful, and innovative.","Công ti của chúng tôi, dù chỉ vừa ra mắt vào năm 2024, cam kết đem tới những trải nghiệm tốt nhất cho người dùng thông qua việc mua sắm tại các chi nhánh hay tại trang thương mại điện tử của chúng tôi."]},
        {"tag":"tai nghe",
        "patterns":["Tai nghe","tầm giá 300 đến 500 đô"],
        "responses":["Tai nghe tầm giá 300 đến 500 đô"]},
        {"tag":"Headphone500",
        "patterns":["Headphone","between 300 and 500 dollar"],
        "responses":["At our shop there are 300 and 500..."]},
        {"tag":"Headphone200",
        "patterns":["Headphone","between 200 and 300 dollar"],
        "responses":["At our shop there are 200 and 300..."]},
        {"tag":"iphone 16",
        "patterns":["Iphone", "16","Iphone 16","introduce","information"],
        "responses":["This is iphone 16 introduction","This is iphone 16 information"]},
        {"tag":"Red Me Note 8",
        "patterns":["Red Me","Note 8","Red Me Note 8","introduce","information"],
        "responses":["This is Red Me Note 8 introduction","This is Red Me Note 8 information"]},
        {"tag":"Asus Head Phone",
        "patterns":["Asus","Asus Headphone","Asus Head Phone"],
        "responses":["This is Asus Head Phone introduction","This is Asus Head Phone information"]},
        {"tag":"Optimizing (tối ưu hóa) definition",
        "patterns":["Optimizing","Tối ưu hóa","Optimization","Tối ưu hóa hàm mục tiêu","Quy hoạch toán học","Heuristic"],
        "responses":["Optimizing ( tối ưu hóa) là việc giải quyết các bài toán quy hoạch toán học, tối ưu hóa hàm mục tiêu","Optimization là giải quyết các bài toán tìm cực trị, tìm phương án tối ưu hoặc cận tối ưu (các bài toán Heuristic)"]},
        {"tag":"Linear Programming",
        "patterns":["Linear Programming","Linear_Programming","Quy hoạch tuyến tính","Quy hoach tuyen tinh","Linear Programming LP","Tối ưu hóa hàm tuyến tính","Linear"],
        "responses":["Linear Programming nghiên cứu các trường hợp khi hàm mục tiêu f là hàm tuyến tính và các ràng buộc có dạng các đẳng thức và bất đẳng thức tuyến tính"]},
        {"tag":"Integer Programming",
        "patterns":["Interger Programming","Interger_Programming","Quy hoạch nguyên","Quy hoach nguyen","Interger Programming IP","tối ưu hóa hàm có số nguyên","Tối ưu hóa với biến nguyên","Interger"],
        "responses":["Interger Programming nghiên cứu các quy hoạch tuyến tính trong đó một số hoặc tất cả các biến có giới hạn là các số nguyên."]},
        {"tag":"Quadratic Programming",
        "patterns":["Quy hoạch toàn phương","Quadratic Programming","Quadratic_Programming","Quy hoạch bậc hai","Quy hoach toan phuong","Quy hoach bac hai","Quadratic Programming QP","Quadratic"],
        "responses":["Quadratic Programming cho phép hàm mục tiêu có các toán hạng bậc hai, trong khi tập A phải mô tả được bằng các đẳng thức và bất đẳng thức tuyến tính (A được gọi là một khúc/phần lồi)."]},
        {"tag":"database",
        "patterns":["Cơ sở dữ liệu","Database","DB","bộ dữ liệu","Data","Lưu trữ dữ liệu", "Hệ quản trị cơ sở dữ liệu", "Quản lý dữ liệu"],
        "responses":["Database là cơ sở dữ liệu, là một bộ sưu tập dữ liệu được tổ chức bày bản và thường được truy cập từ hệ thống máy tính hoặc tồn tại dưới dạng tập tin trong hệ quản trị cơ sở dữ liệu.",
        "Database giúp người dùng trong việc kết nối các dữ liệu. Database chính là cơ sở nguồn để người dùng có thể truy xuất ra những thông tin cần thiết."]},
        {"tag":"bigbang",
        "patterns":["vụ nổ lớn","bigbang","big bang","big bang theory"],
        "responses":["Big bang là mô hình vũ trụ học nổi bật miêu tả giai đoạn sơ khai của sự hình thành vũ trụ","Theo lý thuyết này, Vụ Nổ Lớn xảy ra cách đây khoảng 13,8 tỷ năm trước, do đó được xem là tuổi của vũ trụ"]},
        {"tag":"bagofwords",
        "patterns":["bag of words","bag of word","mô hình túi từ","bag of words model","bag of words model"],
        "responses":["Mô hình túi từ là một biểu diễn đơn giản hóa được sử dụng trong xử lý ngôn ngữ tự nhiên và truy vấn thông tin."
        ,"The bag-of-words model is a model of text which uses a representation of text that is based on an unordered collection (or bag) of words"]},
        {"tag":"toán",
        "patterns":["math","mathematics","mathematical","toán học"],
        "responses":["the study of numbers, shapes, and space using reason and usually a special system of symbols and rules for organizing them"]},
        {"tag":"cộng",
        "patterns":["phép cộng","addition","cộng","plus","tổng"],
        "responses":["Phép cộng, còn được gọi là tính tổng, là kết quả của việc cộng các số hoặc đại lượng một cách số học.","Addition is the process of adding numbers or amounts together with the plus symbol between"]},
        {"tag":"trừ",
        "patterns":["trừ","phép trừ","minus","substraction","hiệu","substract"],
        "responses":["Phép trừ số học sẽ bao gồm trừ 2 hoặc nhiều phần từ để có được kết quả cuối cùng, đó chính là phần tử gốc bị giảm bởi phần tử bị trừ.","Substraction is remove a number from another number"]},
        {"tag":"nhân",
        "patterns":["phép nhân","tích","multi","multiplication"],
        "responses":["Phép nhân tác động tới hai hay nhiều đối tượng toán học (thừa số, còn gọi là nhân tử) để tạo ra một đối tượng toán học mới. Ký hiệu của phép nhân là x (ngắn gọn hơn là ., trong lập trình là dấu *)",
        "the process of adding a number to itself a particular number of times, or a calculation in which this is done"]},
        {"tag":"chia",
        "patterns":["chia","phép chia","divide","division","thương"],
        "responses":["Phép chia thường được biểu diễn trong đại số và khoa học bằng cách đặt số bị chia trên số chia với một dòng kẻ ngang đặt giữa chúng, còn được gọi là vinculum hay thanh phân số. Ví dụ, a chia b được viết là a/b",
        "What is being divided is called the dividend, which is divided by the divisor, and the result is called the quotient"]},
        {"tag": "physics",
        "patterns": ["Physics", "Vật lý","physic"],
        "responses": ["Physics is the study of matter, energy, and the fundamental forces that govern the behavior of the universe."]},
       {"tag": "chemistry",
        "patterns": ["Chemistry", "Hóa học","Hóa"],
        "responses": ["Chemistry is the branch of science that deals with the properties, composition, and reactions of substances."]},
       {"tag": "biology",
        "patterns": ["Biology", "Sinh học","Sinh"],
        "responses": ["Biology is the study of living organisms and their interactions with each other and their environments."]},
       {"tag": "computer_science",
        "patterns": ["Computer Science","Computer_Science", "Khoa học máy tính", "Lập trình máy tính"],
        "responses": ["Computer Science involves the study of algorithms, data structures, and the principles of programming."]},
        {"tag": "history",
         "patterns": ["History", "Lịch sử","Sử"],
         "responses": ["History is the study of past events, particularly in human affairs."]},
        {"tag": "literature",
         "patterns": ["Literature", "Văn học","Văn"],
         "responses": ["Literature includes written works, especially those considered of superior or lasting artistic merit."]},
         {"tag": "machine_learning",
         "patterns": ["Machine Learning","Machine_Learning", "Máy học", "ML","Học máy"],
         "responses": ["Machine Learning is a field of artificial intelligence that focuses on the development of algorithms allowing computers to learn from and make predictions or decisions based on data."]},
        {"tag": "deep_learning",
         "patterns": ["Deep Learning","Deep_Learning", "Học sâu", "DL"],
         "responses": ["Deep Learning is a subset of machine learning that involves neural networks with many layers (deep neural networks). It is used for tasks such as image and speech recognition."]},
        {"tag": "algorithm",
         "patterns": ["Algorithm", "Thuật toán", "Algo","Thuật toán "],
         "responses": ["An algorithm is a step-by-step procedure or formula for solving problems. It is a set of rules to follow in calculations or other problem-solving operations."]},
        {"tag": "neural_networks",
        "patterns": ["Neural Networks","Neural Network","Neural_Networks", "Mạng nơ-ron","mạng nơ ron"],
        "responses": ["Neural Networks are a computational model inspired by the way biological neural networks in the human brain work. They are a fundamental component of deep learning."]},
       {"tag": "reinforcement_learning",
        "patterns": ["Reinforcement Learning","Reinforcement_Learning", "Học củng cố"],
        "responses": ["Reinforcement Learning is a type of machine learning where an agent learns how to behave in an environment by performing actions and receiving rewards or penalties in return."]},
        {"tag": "algebra",
         "patterns": ["Algebra", "Đại số"],
         "responses": ["Algebra is a branch of mathematics dealing with symbols and the rules for manipulating those symbols. It includes the study of mathematical operations and relations."]},
        {"tag": "calculus",
         "patterns": ["Calculus", "Giải tích"],
         "responses": ["Calculus is a branch of mathematics that studies continuous change. It includes differential calculus, concerned with rates of change, and integral calculus, concerned with accumulation of quantities."]},
        {"tag": "probability_statistics",
         "patterns": ["Probability and Statistics", "Xác suất và Thống kê", "Xác suất thống kê"],
         "responses": ["Probability and Statistics is the branch of mathematics that studies the likelihood of events and the analysis of data. It involves concepts like probability, random variables, and statistical inference."]},
        {"tag":"blank",
        "patterns":[" ","I don't know what to ask","No request"],
        "responses":["Have your time to think and ask me again later!"]},
        {"tag":"Python",
        "patterns":["Python","Python Language","Ngôn ngữ lập trình Python"],
        "responses":["Python là một ngôn ngữ lập trình bậc cao cho các mục đích lập trình đa năng, do Guido van Rossum tạo ra và lần đầu ra mắt vào năm 1991"]},
        {"tag":"virtual_environment",
        "patterns":["virtual enviroment","môi trường ảo","virtual_environment"],
        "responses":["A virtual environment is a networked application that allows a user to interact with both the computing environment and the work of other users.",
    "Môi trường ảo là một ứng dụng được nối mạng cho phép người dùng tương tác với cả môi trường máy tính và công việc của những người dùng khác. Email, trò chuyện và các ứng dụng chia sẻ tài liệu dựa trên web đều là những ví dụ về môi trường ảo."]},
        {"tag":"statement",
        "patterns":["mệnh đề","Statement","đúng hoặc sai"],
        "responses":["Mệnh đề là phát biểu khẳng định tính đúng hoặc sai","Statement is a definite or clear expression of something in speech or writing"]},
        {"tag":"expression",
        "patterns":["biểu thức","expression","phép toán mệnh đề","dãy luật"],
        "responses":["Một biểu thức hay một expression là một câu hay công thức của phép toán mệnh đề khi và chỉ khi nó được tạo ra từ những ký hiệp hợp lệ thông qua một dãy luật"]},
        {"tag":"chuẩn horn",
        "patterns":["horn clause","dạng chuẩn horn","chuẩn horn","horn's clause"],
        "responses":["Horn's clause/chuẩn Horn: Mọi công thức đều có thể đưa về dạng chuẩn hội, tức là hội của các tuyển"]},
        {"tag":"tác tử",
        "patterns":["tác tử","agent","cảm nhận môi trường thông qua cảm biến"],
        "responses":["Một tác tử - agent được hiểu là bất cứ thứ gì cảm nhận môi trường quanh nó thông qua các cảm biến và tác động trở lại môi trường thông qua bộ kích hoạt."]},
        {"tag":"decision tree",
        "patterns":["cây quyết định","decision tree","lý thuyết quyết định"],
        "responses":["cây quyết định là một kiểu mô hình dự báo (predictive model), nghĩa là một ánh xạ từ các quan sát về một sự vật/hiện tượng tới các kết luận về giá trị mục tiêu của sự vật/hiện tượng."]},
        {"tag":"framework",
        "patterns":["framework","bộ khung","thuật ngữ framework trong lập trình"],
        "responses":[" Trong công nghệ thông tin, thuật ngữ framework cũng được dùng rất nhiều, nó là một tập hợp các thư viện phần mềm, các trình biên dịch, diễn dịch hoặc các API nhằm cung cấp một môi trường giúp cho việc lập trình ứng dụng trở lên nhanh chóng."]},
        {"tag":"http",
        "patterns":["Hyper text transfer protocol","giao thức truyền tải siêu văn bản","giao thức truyền tải"],
        "responses":["HTTP là 1 giao thức cho phép tìm nạp tài nguyên, chẳng hạn như HTML doc.",
        "Nó là nền tảng của bất kỳ sự trao đổi dữ liệu nào trên Web và cũng là giao thức giữa client (thường là các trình duyệt hay bất kỳ loại thiết bị, chương trình nào) và server (thường là các máy tính trên đám mây)"]},
        {"tag":"domain",
        "patterns":["domain","tên miền"],
        "responses":["A domain name is a unique, easy-to-remember address used to access websites, such as google.com","Tên miền là địa chỉ của một trang web, người dùng sẽ nhập vào công cụ tìm kiếm để đi vào trang chủ của một website cụ thể."]},
        {"tag":"bootstrap",
        "patterns":["bootstrap","Bootstrap"],
        "responses":["Bootstrap là một framework CSS miễn phí sử dụng mã nguồn mở dùng cho mục đích phát triển web front-end cho thiết bị di động.",
        "Bootstrap (formerly Twitter Bootstrap) is a free and open-source CSS framework directed at responsive, mobile-first front-end web development. It contains HTML, CSS and (optionally) JavaScript-based design templates for typography, forms, buttons, navigation, and other interface components."]},
        {"tag":"tailwind",
        "patterns":["tailwind","Tailwind", "Tailwind CSS"],
        "responses":["CSS Tailwind là một khung CSS nguồn mở. Tính năng chính của thư viện này là, không giống như các khung CSS khác như Bootstrap, nó không cung cấp một loạt các lớp được xác định trước cho các thành phần như nút hoặc bảng.",
        "Tailwind CSS is an open source CSS framework. The main feature of this library is that, unlike other CSS frameworks like Bootstrap, it does not provide a series of predefined classes for elements such as buttons or tables. Instead, it creates a list of 'utility' CSS classes that can be used to style each element by mixing and matching."]},
        {"tag":"jquery",
        "patterns":["jquery","Jquery","jQuery"],
        "responses":["jQuery là một thư viện JavaScript được thiết kế đơn giản hóa thao tác HTML DOM, cũng như xử lý sự kiện, hoạt ảnh CSS, và Ajax.",
        "jQuery is a JavaScript library designed to simplify HTML DOM tree traversal and manipulation, as well as event handling, CSS animations, and Ajax."]},
        {"tag":"JavaScript",
        "patterns":["Javascript","javascript"],
        "responses":["JavaScript, theo phiên bản hiện hành, là một ngôn ngữ lập trình được phát triển từ các ý niệm nguyên mẫu. Ngôn ngữ này được dùng rộng rãi cho các trang web (phía người dùng) cũng như phía máy chủ (với Nodejs).",
        " JavaScript (JS) is a lightweight interpreted (or just-in-time compiled) programming language with first-class functions."]},
        {"tag":"React",
        "patterns":["React","ReactJS","react"],
        "responses":["React là một thư viện JavaScript front-end mã nguồn mở và miễn phí để xây dựng giao diện người dùng dựa trên các thành phần UI riêng lẻ.",
        "React is a free and open-source front-end JavaScript library for building user interfaces based on components. It is maintained by Meta (formerly Facebook)"]},
        {
            "tag": "Angular",
            "patterns": ["Angular", "AngularJS","angular"],
            "responses": ["Angular là một nền tảng phát triển ứng dụng web front-end được phát triển bởi Google.",
                          "Angular is a front-end web application development platform developed by Google."]
        },
        {
            "tag": "PHP",
            "patterns": ["PHP","php"],
            "responses": ["PHP là một ngôn ngữ lập trình mã nguồn mở chuyên dùng cho việc phát triển web.",
                          "PHP is an open-source programming language primarily used for web development."]
        },
        {
            "tag": "C",
            "patterns": ["C", "C programming"],
            "responses": ["C là một ngôn ngữ lập trình máy tính được phát triển tại Bell Labs vào những năm 1970.",
                          "C is a computer programming language developed at Bell Labs in the early 1970s."]
        },
        {
            "tag": "Java",
            "patterns": ["Java","java"],
            "responses": ["Java là một ngôn ngữ lập trình và một nền tảng tính toán được phát triển bởi Sun Microsystems, hiện nay là một phần của Oracle.",
                          "Java is a programming language and computing platform developed by Sun Microsystems, now owned by Oracle."]
        },
        {"tag":"Hà Nội",
        "patterns":["Ha Noi","Hà Nội","thủ đô Việt Nam"],
        "responses":["Hà Nội, thủ đô của Việt Nam, nổi tiếng với kiến trúc trăm tuổi và nền văn hóa phong phú với sự ảnh hưởng của khu vực Đông Nam Á, Trung Quốc và Pháp.",
        "Hà Nội nằm ở tả ngạn sông Đà và hai bên đồng bằng sông Hồng. Thành phố này có vị trí chiến lược giáp với các tỉnh lân cận. Phía Bắc giáp với tỉnh Vĩnh Phúc và Thái Nguyên, phía Nam giáp tỉnh Hòa Bình, phía Đông giáp với tỉnh Bắc Ninh và Hưng Yên, còn phía Tây giáp tỉnh Vĩnh Phúc."]},
        {"tag":"Hồ Chí Minh",
        "patterns":["Hồ Chí Minh","Ho Chi Minh"],
        "responses":["Hồ Chí Minh, tên khai sinh là Nguyễn Sinh Cung, còn được biết với tên gọi Bác Hồ, là một nhà cách mạng và chính khách người Việt Nam.",
        "Chủ tịch Hồ Chí Minh là người thầy vĩ đại của cách mạng Việt Nam, lãnh tụ kính yêu của giai cấp công nhân và của cả dân tộc Việt Nam, một chiến sĩ xuất sắc, một nhà hoạt động lỗi lạc của phong trào cộng sản quốc tế và phong trào giải phóng dân tộc."]},
        {"tag":"ChatGPT",
        "patterns":["ChatGPT","chatgpt","Chatgpt"],
        "responses":["ChatGPT, viết tắt của Chat Generative Pre-training Transformer, là một chatbot do công ty OpenAI của Mỹ phát triển và ra mắt vào tháng 11 năm 2022.",
        "ChatGPT is a free-to-use AI system. Use it for engaging conversations, gain insights, automate tasks, and witness the future of AI, all in one place."]},
        {"tag":"Model-View-Controller",
        "patterns":["Model-View-Controller","MVC","Model View Controller"],
        "responses":["MVC là một mẫu kiến trúc phần mềm để tạo lập giao diện người dùng trên máy tính. MVC chia một ứng dụng thành ba phần tương tác được với nhau để tách biệt giữa cách thức mà thông tin được xử lý nội hàm và phần thông tin được trình bày và tiếp nhận từ phía người dùng.",
        "MVC(Model View Controller) is a software design pattern commonly used for developing user interfaces that divides the related program logic into three interconnected elements."]},
        {"tag":"World Wide Web",
        "patterns":["www","World Wide Web","World wide web","world wide web","mạng toàn cầu"],
        "responses":["World Wide Web, gọi tắt là WWW, mạng lưới toàn cầu là một không gian thông tin toàn cầu mà mọi người có thể truy cập (đọc và viết) thông tin qua các thiết bị kết nối với mạng Internet",
        "The World Wide Web -- also known as the web, WWW or W3 -- refers to all the public websites or pages that users can access on their local computers and other devices through the internet"]
        },
        {"tag":"Data Mining",
        "patterns":["Data Mining","data mining","Data mining"],
        "responses":["Data mining(khai phá dữ liệu) là quá trình phân loại, sắp xếp các tập hợp dữ liệu nhất định để xác định xu hướng, các mẫu và thiết lập các mối liên hệ hữu ích nhằm giải quyết các vấn đề nhờ phân tích dữ liệu.",
        "Data mining is the process of searching and analyzing a large batch of raw data in order to identify patterns and extract useful information."]
        },
        {"tag":"Big Data",
        "patterns":["Dữ liệu lớn","big data","Big data","Big Data"],
        "responses":["Dữ liệu lớn là một thuật ngữ cho việc xử lý một tập hợp dữ liệu rất lớn và phức tạp mà các ứng dụng xử lý dữ liệu truyền thống không xử lý được.",
        "Big data primarily refers to data sets that are too large or complex to be dealt with by traditional data-processing application software. "]
        },
        {"tag":"Phân lớp dữ liệu",
        "patterns":["Phân lớp dữ liệu","data classification"],
        "responses":["Phân lớp dữ liệu là kĩ thuật dựa trên tập huấn luyện và những giá trị hay hay là nhãn của lớp trong một thuộc tính phân lớp và sử dụng nó trong việc phân lớp dữ liệu mới",
         "Data classification is the process of separating and organizing data into relevant groups (“classes”) based on their shared characteristics, such as their level of sensitivity, the risks they present, and the compliance regulations that protect them."]
        },
        {"tag":"IOT",
        "patterns":["Internet of thing","IOT","iot","Iot","Mạng internet vạn vật"],
        "responses":["Thuật ngữ IoT hay Internet vạn vật đề cập đến mạng lưới tập hợp các thiết bị thông minh và công nghệ tạo điều kiện thuận lợi cho hoạt động giao tiếp giữa thiết bị và đám mây cũng như giữa các thiết bị với nhau.",
    "The Internet of things (IoT) describes devices with sensors, processing ability, software and other technologies that connect and exchange data with other devices and systems over the Internet or other communications networks."]
        },
        {"tag":"Metaverse",
        "patterns":["metaverse","Metaverse","Meta universe","meta universe"],
        "responses":["Metaverse là một giả thuyết cải tiến của internet trong đó nó hỗ trợ một môi trường ảo 3 chiều bền vững thông qua máy tính cá nhân thông thường cũng như thực tế ảo và thực tế ảo tăng cường. Một số phiên bản và nền tảng tương tự mang tính metaverse nhưng hạn chế hơn như VRChat hoặc trò chơi như Second Life.",
        "The metaverse is a loosely defined term referring to virtual worlds in which users represented by avatars interact, usually in 3D and usually focused on social and economic connection."]
        }
    ]
}